Repository: running-grass/omegat
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Here are a few examples, the header for the file ‘ol-bbdb.el’ contains more detailed information.
zh_cn: 以下是几个示例，文件‘ol-bbdb.el’的标头包含更详细的信息。

source: Here are commands to get information about the size and position of parts of the buffer, and to count words and lines.
zh_cn: 以下命令用于获取有关缓冲区各部分的大小和位置的信息，并对字数和行数进行计数。

source: Here are some examples, using only tags.
zh_cn: 下面是一些搜索标签的例子，

source: Here are special commands and techniques for inserting and deleting blank lines.
zh_cn: 以下是用于插入和删除空行的特殊命令和技术。

source: Here are suggested bindings, please modify the keys to your own liking.
zh_cn: 以下是建议的绑定，请根据自己的喜好修改按键。

source: Here is a list of the completion commands defined in the minibuffer when completion is allowed.
zh_cn: 以下是允许补全时在微型缓冲区中定义的补全命令列表。

source: Here is a summary of help commands for accessing the built-in documentation.
zh_cn: 以下是用于访问内置文档的帮助命令摘要。

source: Here is how to produce a useful backtrace:
zh_cn: 这是产生有用的回溯的方法：

source: Here the file name is given as an argument to the command C-x C-f (find-file).
zh_cn: 这里，文件名作为C-x C-f(find-file)的参数提供给命令。

source: Here we explain the basics of how to enter text, make corrections, and save the text in a file.
zh_cn: 在这里，我们将介绍如何输入文本、进行更正以及将文本保存到文件中的基础知识。

source: Here, C-u terminates the prefix argument, so that the next keystroke begins the command that you want to execute.
zh_cn: 这里，C-u终止前缀参数，以便下一次击键开始您想要执行的命令。

source: Here, ‘Find file: ’ is the prompt and ‘/u2/emacs/src/’ is the default directory.
zh_cn: 这里，“Find file:”是提示符，“/u2/emacs/src/”是默认目录。

source: Here’s an example custom agenda command that will display all actions for the @office context:
zh_cn: 下面是一个自定义议程命令示例，它将显示@office上下文的所有行动：

source: Here’s an example project:
zh_cn: 以下是一个示例项目：

source: Here’s how I set it up:
zh_cn: 下面是我的设置方式：

source: Here’s how my inbox looks like:
zh_cn: 下面是我的收件箱的样子：

source: Highlighting states.
zh_cn: 状态的高亮显示。

source: Hitting repeatedly marks subsequent subtrees of the same level as the marked subtree.
zh_cn: 重复执行标记命令将会标记的与该子树相同级别的后续子树。

source: Horizontal Rules
zh_cn: 水平尺

source: Horizontal rules in LaTeX export
zh_cn: LaTeX导出中的横向规则

source: How Completion Alternatives Are Chosen
zh_cn: 如何选择补全备选方案

source: How Emacs displays lines too wide for the screen.
zh_cn: Emacs如何显示屏幕无法显示的行。

source: How Org came into being.
zh_cn: Org是如何产生的。

source: How Org mode helps you enter dates and times.
zh_cn: Org模式如何帮助您输入日期和时间。

source: How agenda items are prepared for display.
zh_cn: 议程事项的显示方式。

source: How completion matches are chosen.
zh_cn: 选择补全匹配的方式。

source: How consistent have you been?
zh_cn: 你一直坚持到什么程度？

source: How links in Org are formatted.
zh_cn: Org中链接的格式设置方式。

source: How properties are spelled out.
zh_cn: 属性的拼写方式。

source: How the agenda knows the time.
zh_cn: 议事日程怎么知道时间。

source: How to access attachment commands
zh_cn: 如何访问附件命令

source: How to activate Org for certain buffers.
zh_cn: 如何从某一缓冲区激活Org。

source: How to assign tags to a headline.
zh_cn: 如何为标题分配标签。

source: How to compute durations and time values.
zh_cn: 如何计算时间与时长。

source: How to create a useful backtrace
zh_cn: 如何创建有用的回溯

source: How to create and use column view.
zh_cn: 如何创建和使用列视图。

source: How to edit in the minibuffer.
zh_cn: 如何在迷你缓冲区中编辑。

source: How to get files up on the server.
zh_cn: 如何将文件上传到服务器。

source: How to get the latest Emacs distribution.
zh_cn: 如何获得最新的Emacs发行版。

source: How to hack your way around.
zh_cn: 如何定制你想要的功能。

source: How to insert figures into HTML output.
zh_cn: 如何将图形插入到HTML输出中。

source: How to insert figures into LaTeX output.
zh_cn: 如何将图形插入到LaTeX输出中。

source: How to interpret what you see on the screen.
zh_cn: 如何解读你在屏幕上看到的东西。

source: How to modify the formatting of tables.
zh_cn: 如何修改表格的格式。

source: How to reach into Org’s internals.
zh_cn: 如何进入Org的内部。

source: How to refer to another field or range.
zh_cn: 如何引用另一个字段或范围。

source: How to typeset Org tree headlines.
zh_cn: 如何排版Org树标题。

source: How to use the menu bar.
zh_cn: 如何使用菜单栏。

source: How to write new export back-ends.
zh_cn: 如何编写新的导出后端。

source: However if you are using Org mode as distributed with Emacs, a minimal setup is not necessary.
zh_cn: 但是，如果您使用的是随Emacs一起分发的Org模式，则无需进行最小设置。

source: However, ESC F1
zh_cn: 但是，EscF1

source: However, any scheduling information without a repeater is no longer relevant once the task is done, and thus, removed upon repeating the task.
zh_cn: 然而，一旦任务完成，任何没有复读机的日程安排信息都不再相关，因此在重复任务时将其删除。

source: However, from then on things will be very fast, much faster in fact than a long list of ‘%%(diary-anniversary)’ entries in an Org or Diary file.
zh_cn: 然而，从那时起，事情将变得非常快，实际上比Org或日记文件中的‘%%(diary-anniversary)’条目的长列表要快得多。

source: However, if default-directory (see File Names) for the current buffer is on a remote machine, ‘@’ is displayed instead.
zh_cn: 但是，如果当前缓冲区的默认目录(请参阅文件名)位于远程计算机上，则会显示“@”。

source: However, if all possible completions end in otherwise-ignored strings, they are not ignored: in the previous example, ‘foo.e’ completes to ‘foo.elc’.
zh_cn: 但是，如果所有可能的补全都以其他被忽略的字符串结尾，则它们不会被忽略：在上一个示例中，“foo.e”补全于“foo.elc”。

source: However, if the command you want to repeat prompts for input, or uses a numeric argument in another way, that method won’t work.
zh_cn: 但是，如果要重复输入的命令提示输入，或者以其他方式使用数字参数，则该方法将不起作用。

source: However, if you add two or more lines’ worth of text into the minibuffer, it expands automatically to accommodate the text.
zh_cn: 但是，如果您将两行或更多行的文本添加到迷你缓冲区中，它会自动扩展以容纳文本。

source: However, if you leave at least two empty lines, one empty line remains visible after folding the subtree, in order to structure the collapsed view.
zh_cn: 但是，如果您保留至少两个空行，则在折叠子树后仍有一个空行可见，以便构建折叠视图的结构。

source: However, if you narrow the buffer, the mode line shows the line number relative to the accessible portion (see Narrowing).
zh_cn: 但是，如果聚焦缓冲区，状态栏将显示相对于可访问部分的行号(请参阅聚焦)。

source: However, if you set the variable next-line-add-newlines to a non-nil value, C-n on the last line of a buffer creates an additional line at the end and moves down into it.
zh_cn: 但是，如果将变量next-line-add-newlines设置为非nil值，则缓冲区最后一行上的C-n将在末尾创建一个附加行并向下移动。

source: However, it also implements another, quicker, tag selection method called fast tag selection.
zh_cn: 但是，它还实现了另一种更快的标签选择方法，称为快速标记选择。

source: However, it may be easier to see what you are doing if you first make a blank line and then insert the desired text into it.
zh_cn: 但是，如果您首先创建一个空行，然后在其中插入所需的文本，则可能更容易看到您正在执行的操作。

source: However, it stays on a Sunday, even if you called and marked it
zh_cn: 然而，它将停留在星期天，即使您在周六就打电话并标记了它。

source: However, the edited argument does go at the end of the history list when you submit it.
zh_cn: 但是，当您提交已编辑的参数时，它确实会出现在历史记录列表的末尾。

source: However, you can subdivide this window horizontally or vertically to create multiple windows, each of which can independently display a buffer (see Windows).
zh_cn: 但是，您可以水平或垂直分割此窗口以创建多个窗口，每个窗口都可以独立显示一个缓冲区(请参阅窗口)。

source: However, you may want to dynamically number some, or all, of them.
zh_cn: 但是，你可能希望对其中的一些或全部进行动态编号。

source: Hyperlink access to attachments
zh_cn: 附件的超链接访问

source: Hyperlinks
zh_cn: 超链接

source: I also link emails (which I happen to read within Emacs) using org-store-link.
zh_cn: 我还使用org-store-link链接电子邮件(如果我碰巧在Emacs中看到了它们)。

source: I do this, Fred does the rest.
zh_cn: 我做这个，Fred休息。

source: I have set up the refile targets as follows:
zh_cn: 我已经按如下方式设置了转接目标：

source: I make heavy use of them in custom Org Agenda commands.
zh_cn: 我在自定义Org议程命令中大量使用它们。

source: I press C-c c t to add an entry to my inbox, and C-c c T to add an entry to the tickler (more on that later).
zh_cn: 按C-c c t将条目添加到我的收件箱，按C-c c T将条目添加到记事本(稍后将详细介绍)。

source: I put a todo keyword in all project entries.
zh_cn: 我在所有项目条目中都放了一个关键字。

source: I split my GTD in four separate files:
zh_cn: 我将GTD拆分为四个单独的文件：

source: I tend to avoid using timestamps in my projects as much as possible.
zh_cn: 我倾向于尽量避免在我的项目中使用时间戳。

source: I think I use fairly regular todo keywords: TODO, WAITING, DONE and CANCELLED mostly.
zh_cn: 我想我主要使用相当常规的关键字：TODO、WAITING、DONE和CANCELLED。

source: I use custom agenda commands mostly to get an overview of actions by context or tag.
zh_cn: 我使用自定义议程命令主要是为了根据上下文或标签获得行动概述。

source: I use tags for several purposes:
zh_cn: 我使用标签有几个目的：

source: I usually have around 30 active projects at the same time.
zh_cn: 我通常在同一时间有大约30个正在进行的项目。

source: If completion-auto-help is set to nil, the completion commands never display the completion list buffer; you must type ? to display the list.
zh_cn: 如果completion-auto-help设置为nil，则补全命令永远不会显示补全列表缓冲区；您必须键入？才能显示列表。

source: If completion-cycle-threshold is non-nil, completion commands can cycle through completion alternatives.
zh_cn: 如果completion-cycle-threshold为非nil，则补全命令可以循环补全备选方案。

source: If initial-buffer-choice is non-nil, then if you specify any files on the command line, Emacs still visits them, but does not display them initially.
zh_cn: 如果initial-buffer-option不是nil，那么如果您在命令行上指定任何文件，Emacs仍然会访问它们，但最初不会显示它们。

source: If q is not assigned to a tag, it aborts like C-g.
zh_cn: 如果q未分配给标记，它将像C-g一样中止。

source: If TAB or SPC is unable to complete, it displays a list of matching completion alternatives (if there are any) in another window.
zh_cn: 如果TAB或SPC无法补全，它会在另一个窗口中显示匹配的补全备选方案(如果有)的列表。

source: If N is negative then go up that many levels.
zh_cn: 如果N为负，则上升到该级别。

source: If Emacs is in one recursive editing level within another, double square brackets appear, and so on.
zh_cn: 如果Emacs在另一个递归编辑级别中处于另一个递归编辑级别，则会出现双方括号，依此类推。

source: If a different string is displayed, that indicates a nontrivial end-of-line convention for encoding a file.
zh_cn: 如果显示不同的字符串，则表示对文件进行编码的重要行尾约定。

source: If a directory is part of this list, all files with the extension ‘.org’ in this directory are part of the list.
zh_cn: 如果变量org-agenda-files为一个文件目录，则该目录下所有‘.org’文件都为agenda files。

source: If a heading has a certain tag, all subheadings inherit the tag as well.
zh_cn: 如果标题具有某个标签，则所有子标题也会继承该标签。

source: If a key sequence invokes a command, we call it a complete key; for example, C-f, C-x C-f and C-x 4 C-f are all complete keys.
zh_cn: 如果使用按键序列调用命令，我们将其称为完全键；例如，C-f、C-x C-f和C-x 4 C-f都是完全键。

source: If a key sequence isn’t long enough to invoke a command, we call it a prefix key; from the preceding example, we see that C-x and C-x 4 are prefix keys.
zh_cn: 如果键序列不足以调用命令，我们将其称为前缀键；从前面的示例中，我们可以看到C-x和C-x 4是前缀键。

source: If a style produces no matches, Emacs falls back on the next style.
zh_cn: 如果某个风格没有生成匹配项，则Emacs会退回到下一个风格。

source: If a style yields one or more matches, that is used as the list of completion alternatives.
zh_cn: 如果风格生成一个或多个匹配项，则将其用作补全备选方案的列表。

source: If agenda is already restricted there, remove the restriction.
zh_cn: 如果此处已经有限制，那么会移除它。

source: If all recorded changes have already been undone, the undo command displays an error message and does nothing.
zh_cn: 如果所有记录的更改都已撤消，则撤消命令将显示一条错误消息，并且不执行任何操作。

source: If an error message or an informative message is emitted while the minibuffer is active, the message hides the minibuffer for a few seconds, or until you type something; then the minibuffer comes back.
zh_cn: 如果在迷你缓冲区处于活动状态时发出错误消息或信息性消息，则该消息会将迷你缓冲区隐藏几秒钟，或者直到您键入内容；然后迷你缓冲区才会返回。

source: If an error occurs, a “backtrace” can be very useful—see below on how to create one.
zh_cn: 如果发生错误，“回溯”可能会非常有用-请参阅下文，了解如何创建。

source: If at least one tag has a selection key then pressing C-c C-c automatically presents you with a special interface, listing inherited tags, the tags of the current headline, and a list of all valid tags with corresponding keys54.
zh_cn: 如果至少有一个标签有选择键，则按C-c C-c会自动显示一个特殊界面，其中列出继承的标签、当前标题的标签以及具有相应键的所有有效标签的列表54。

source: If called with a prefix argument, move to the column number specified by the argument’s numeric value.
zh_cn: 如果使用前缀参数调用，请移动到参数的数字值指定的列号。

source: If headlines in the agenda files are marked with tags (see Tags), or have properties (see Properties and Columns), you can select headlines based on this metadata and collect them into an agenda buffer.
zh_cn: 如果议程文件中的headline带有标签（详见标签）和属性（详见属性和列视图）,则你可以根据这些元数据作为匹配条件来筛选事项.

source: If it is a dash (‘-’), that indicates no special character set handling (with the possible exception of end-of-line conventions, described in the next paragraph).
zh_cn: 如果它是破折号(‘-’)，则表示没有特殊的字符集处理(下一段中描述的行尾约定可能除外)。

source: If it is non-nil, adding a new element deletes from the list all other elements that are equal to it.
zh_cn: 如果它是非nil，则添加新元素将从列表中删除与其相等的所有其他元素。

source: If it says the command is not on any key, that means you must use M-x to run it.
zh_cn: 如果它显示该命令不在任何键上，这意味着您必须使用M-x来运行它。

source: If it was already in the list, it is moved to the front.
zh_cn: 如果该文件已经在列表中，那么就会将它移动到首位。

source: If narrowing is in effect restrict to the narrowed part of the buffer.
zh_cn: 如果当前buffer使用了聚焦命令（org-narrow-to-subtree），那么只会限制议程视图的显示范围为聚焦的部分。

source: If need be, I create a new project out of it.
zh_cn: 如果需要，我会用它创建一个新项目。

source: If point is at the end of the line, the effect is to create a new blank line after it and indent the new line; if point is in the middle of a line, the line is split at that position.
zh_cn: 如果游标在行尾，则效果是在它之后创建新的空行并缩进新行；如果游标在行的中间，则该行将在该位置拆分。

source: If point is on a nonblank line, C-x C-o deletes all following blank lines, if any exists.
zh_cn: 如果游标位于非空行上，C-x C-o将删除后面的所有空行(如果存在)。

source: If point is on a single blank line, C-x C-o deletes it.
zh_cn: 如果游标在单个空行上，C-x C-o会将其删除。

source: If point is on or just after a number in the buffer, that is the default for n.
zh_cn: 如果游标处于打开状态或恰好在缓冲区中的数字之后，则这是n的默认设置。

source: If point lies within a run of several blank lines, C-x C-o deletes all but one of them.
zh_cn: 如果游标位于几个空行的运行范围内，C-x C-o将删除除一个空行之外的所有空行。

source: If point was at the beginning of a line, this deletes the preceding newline, joining this line to the previous one.
zh_cn: 如果游标位于行的开头，则会删除前面的换行符，将此行与上一行合并。

source: If point was at the end of a line, this joins the following line onto this one.
zh_cn: 如果点在一条线的末尾，这会将下面的线连接到这条线上。

source: If so, set the variable org-agenda-skip-scheduled-if-deadline-is-shown to repeated-after-deadline.
zh_cn: 如果是这样，请将变量org-agenda-skip-scheduled-if-deadline-is-shown设置为repeat-after-deadline。

source: If something surprising happens, and you are not sure what you typed, use C-h l (view-lossage).
zh_cn: 如果发生意外情况，并且您不确定键入的内容，请使用C-h l(view-lossage)。

source: If the buffer has been narrowed, making some of the text at the beginning and the end temporarily inaccessible, C-x = displays additional text describing the currently accessible range.
zh_cn: 如果缓冲区被聚焦，导致开头和结尾的某些文本暂时不可访问，C-x =将显示描述当前可访问范围的附加文本。

source: If the buffer is modified, it shows two stars (‘**’).
zh_cn: 如果修改缓冲区，它将显示两个星号(‘**’)。

source: If the bug persists, prepare a report and provide as much information as possible, including the version information of Emacs (M-x emacs-version) and Org (M-x org-version), as well as the Org related setup in the Emacs init file.
zh_cn: 如果bug在新版本依旧存在，请准备一份报告，并提供尽可能多的信息，包括Emacs(M-x emacs-version)和Org (M-x org-version)的版本信息，以及在Emacs init文件中关于Org的相关配置。

source: If the command is used at the beginning of a line, and if there is a heading or a plain list item (see Plain Lists) at point, the new heading/item is created before the current line.
zh_cn: 如果在行的开始处使用该命令，并且在光标处有标题或普通列表项(请参阅普通列表)，则在当前行之前创建新的标题/项。

source: If the first line in the region was an item, turn only the item lines into headlines.
zh_cn: 如果区域中的第一行是列表项，则仅将列表项行变为标题。

source: If the minibuffer prompt for C-h f shows the function name from the buffer as the default, it means that name is defined as a Lisp function.
zh_cn: 如果C-h f的迷你缓冲区提示将缓冲区中的函数名显示为默认值，则意味着该名称被定义为Lisp函数。

source: If the radix is 16, the letters a to f serve as part of a character code, just like digits.
zh_cn: 如果基数是16，字母a到f将作为字符代码的一部分，就像数字一样。

source: If the region is active (see Mark), display the numbers for the region instead.
zh_cn: 如果该选区处于活动状态(请参阅标记)，则改为显示该选区的数字。

source: If the repeater is set for the scheduling information only, you probably want the repeater to be ignored after the deadline.
zh_cn: 如果仅为日程安排信息设置复读机，您可能希望在截止日期之后忽略复读机。

source: If the result of the function call is non-nil, the session is killed, otherwise Emacs continues to run.
zh_cn: 如果函数调用的结果为非nil，会话将被终止，否则Emacs将继续运行。

source: If the symbol has more than one definition, like it has both definition as a function and as a variable, this command will show the documentation of all of them, one after the other.
zh_cn: 如果符号有多个定义，比如它同时定义为函数和变量，则此命令将一个接一个地显示所有定义的文档。

source: If the tag is only relevant to the file you are working on, then you can instead set the ‘TAGS’ keyword as:
zh_cn: 如果标签仅与您正在处理的文件相关，则可以将“TAGS”关键字设置为：

source: If the terminating character is RET, that RET serves only to terminate the sequence.
zh_cn: 如果终止字符是RET，则RET仅用于终止序列。

source: If the text completes to an exact match, RET performs that completion but does not exit yet; you must type a second RET to exit.
zh_cn: 如果文本完全匹配，RET将执行该补全，但尚未退出；您必须键入第二个RET才能退出。

source: If the user option what-cursor-show-names is non-nil, the name of the character, as defined by the Unicode Character Database, is shown as well.
zh_cn: 如果用户选项what-cursor-show-names为非nil，则还会显示Unicode字符数据库定义的字符名称。

source: If the value is t, there is no maximum length.
zh_cn: 如果值为t，则没有最大长度。

source: If the value is t, the minibuffer window will also shrink automatically if you remove some lines of text from the minibuffer, down to a minimum of one screen line.
zh_cn: 如果该值为t，如果您从迷你缓冲区中删除一些文本行，则迷你缓冲区窗口也会自动缩小，最小只有一个屏幕行。

source: If the value is lazy, Emacs only shows the completion list buffer on the second attempt to complete.
zh_cn: 如果值为lazy，则Emacs仅在第二次尝试补全时显示补全列表缓冲区。

source: If the value is nil, the minibuffer window never changes size automatically, but you can use the usual window-resizing commands on it (see Windows).
zh_cn: 如果该值为nil，则微型缓冲区窗口永远不会自动更改大小，但您可以在其上使用常用的窗口大小调整命令(请参阅窗口)。

source: If the value of the variable confirm-kill-emacs is non-nil, C-x C-c assumes that its value is a predicate function, and calls that function.
zh_cn: 如果变量confirm-kill-emacs的值非nil，则C-x C-c假定其值是谓词函数(译者注: 返回值为布尔类型)，并调用该函数。

source: If the value of the variable confirm-kill-processes is nil, C-x C-c does not ask for confirmation before killing subprocesses started by Emacs.
zh_cn: 如果变量confirm-kill-process的值为nil，则C-x C-c在终止Emacs启动的子进程之前不会要求确认。

source: If the variable apropos-do-all is non-nil, most apropos commands behave as if they had been given a prefix argument.
zh_cn: 如果变量apropos-do-all是非nil，则大多数主题搜索命令的行为就像它们被赋予了前缀参数一样。

source: If the variable inhibit-startup-screen is non-nil, Emacs does not display the startup screen.
zh_cn: 如果变量inhibit-startup-screen为非nil，则Emacs不显示启动屏幕。

source: If the variable apropos-sort-by-scores is non-nil, these commands instead try to guess the relevance of each result, and display the most relevant ones first.
zh_cn: 如果变量apropos-sort-by-scores是非nil，则这些命令会尝试猜测每个结果的相关性，并首先显示最相关的结果。

source: If there already is a restriction at point, remove it.
zh_cn: 如果已经限制在光标处的子树，那么就会移除限制。

source: If there are any modified file-visiting buffers when you type C-x C-c, Emacs first offers to save these buffers.
zh_cn: 如果在您键入C-x C-c时有任何修改过的文件访问缓冲区，Emacs会首先提示保存这些缓冲区。

source: If there is a window displaying an agenda view, the new restriction takes effect immediately.
zh_cn: 如果在设置范围限制时有一个窗口在显示议程视图，那么新的限制会立刻生效。

source: If there is an active region, restrict the following agenda command to the region.
zh_cn: 如果有active region,则该命令限制接下来agenda视图的显示范围为该region.

source: If there is an active region, turn all lines in the region into headlines.
zh_cn: 如果存在活动区域，会将该区域中的所有行都变成标题。

source: If this material is new to you, we suggest you first run the Emacs learn-by-doing tutorial, by typing C-h t (help-with-tutorial).
zh_cn: 如果您对本材料不熟悉，我们建议您首先运行Emacs实践学习教程，方法是键入C-h t(help-with-tutorial)。

source: If working with Org produces an error with a message you do not understand, you may have hit a bug.
zh_cn: 如果与Org一起使用时出现错误，并显示一条您不理解的消息，则可能是您遇到了错误。

source: If you
zh_cn: 如果你

source: If you alter the text, you can save the new text in the file by typing C-x C-s (save-buffer).
zh_cn: 如果更改文本，可以通过键入C-x C-s(save-buffer)保存文件中的新文本。

source: If you are editing several files in Emacs, each in its own buffer, each buffer has its own value of point.
zh_cn: 如果在Emacs中编辑多个文件，每个文件都在自己的缓冲区中，则每个缓冲区都有自己的游标。

source: If you are looking for a certain feature, but don’t know what it is called or where to look, we recommend three methods.
zh_cn: 如果您正在寻找某个功能，但不知道它叫什么或在哪里查找，我们推荐三种方法。

source: If you are not a member of the mailing list, your mail will be passed to the list after a moderator has approved it2.
zh_cn: 如果你不是一个邮件组的成员，经过主持人的批准后，你的邮件将被传递到该列表。2.

source: If you are not sending the Email from within Emacs, please copy and paste the content into your Email program.
zh_cn: 如果您不是从Emacs内部发送电子邮件，请复制内容并将其粘贴到您的电子邮件程序中。

source: If you are using expert mode, the first C-c displays the selection window.
zh_cn: 如果您使用的是专家模式，则第一个C-c将显示选择窗口。

source: If you are using the diary only for expression entries and holidays, it is faster to not use the above setting, but instead to copy or even move the entries into an Org file.
zh_cn: 如果仅将日记用于表达式条目和节假日，则不使用上述设置，而是将条目复制甚至移动到Org文件中会更快。

source: If you call Emacs this way, the initial frame is split into two windows—one showing the specified file, and the other showing the startup screen.
zh_cn: 如果以这种方式调用Emacs，初始帧将被分成两个窗口-一个显示指定的文件，另一个显示启动屏幕。

source: If you change completion-cycle-threshold to t, the completion command instead completes to the first of those completion alternatives; each subsequent invocation of the completion command replaces that with the next completion alternative, in a cyclic manner.
zh_cn: 如果将completion-cycle-threshold更改为t，则补全命令将改为补全到这些补全备选方案中的第一个；每次后续调用补全命令都会以循环方式将其替换为下一个补全备选方案。

source: If you change it to nil, Emacs does not ask for confirmation, falling back on permissive completion.
zh_cn: 如果将其更改为nil，则Emacs不会要求确认，而是退回到宽松补全。

source: If you change it to any other non-nil value, Emacs asks for confirmation whether or not the preceding command was TAB.
zh_cn: 如果将其更改为任何其他非nil值，则Emacs会要求确认前面的命令是否为TAB。

source: If you do not like it, you can create an active region by using the mouse to select a region, or pressing C-SPC twice before moving point.
zh_cn: 如果您不喜欢它，可以通过使用鼠标选择一个区域或在光标之前按两次C-SPC来创建活动区域。

source: If you do not save them all, it asks for confirmation again, since the unsaved changes will be lost.
zh_cn: 如果不全部保存，系统会再次要求确认，因为未保存的更改将丢失。

source: If you do not want the line to be split, customize org-M-RET-may-split-line.
zh_cn: 如果不想拆分该行，请自定义org-M-ret-May-plit-line。

source: If you don’t know Orgmode and are curious about it, you should head to its website first.
zh_cn: 如果您不了解Orgmode并对其感兴趣，您应该先访问其网站。

source: If you edit the text inserted by the M-p or M-n minibuffer history commands, this does not change its entry in the history list.
zh_cn: 如果编辑由M-p或M-n迷你缓冲区历史命令插入的文本，这不会更改其在历史记录列表中的条目。

source: If you enable Minibuffer Electric Default mode, a global minor mode, Emacs hides the default argument as soon as you modify the contents of the minibuffer (since typing RET would no longer submit that default).
zh_cn: 如果您启用了Minibuffer Electric Default mode(一种全局辅模式)，Emacs会在您修改迷你缓冲区的内容时立即隐藏默认参数(因为键入RET将不再提交该默认参数)。

source: If you enter a code-point, it should be as a hexadecimal number (the convention for Unicode), or a number with a specified radix, e.g., #o23072 (octal); See Integer Basics in The Emacs Lisp Reference Manual.
zh_cn: 如果输入编码，它应该是十六进制数字(Unicode的约定)或具有指定基数的数字，例如，#o23072(八进制)；请参阅Emacs Lisp参考手册中的整数基础。

source: If you enter a name, the command provides completion (see Completion).
zh_cn: 如果输入名称，该命令将提供补全(请参见补全)。

source: If you enter more than one digit, you need not hold down the Meta key for the second and subsequent digits.
zh_cn: 如果输入多个数字，则不需要按住Meta键输入第二个和后续数字。

source: If you ever bring back the original minibuffer text, the prompt again shows the default.
zh_cn: 如果您键入原始的微型缓冲区文本，提示将再次显示默认值。
